DdogezD/ps4-900u-host/ESP32_Server_900u_HTTP_SPIFFS/ESP32_Server_900u_HTTP_SPIFFS.ino
#include <FS.h>
#include "WiFi.h"
#include <WiFiUdp.h>
#include "lwip/lwip_napt.h"
#include "ESPAsyncWebServer.h"
#include "esp_task_wdt.h"
#include <DNSServer.h>
#include <ESPmDNS.h>
#include <Update.h>

// Brownout detector threshold control (ESP32-S2 regi2c analog BOD).
// Lowering it from the core default (level 7 = most sensitive) reduces spurious
// brownout resets on marginal power. Must be declared at file scope (extern "C"
// is not allowed inside a function by the Arduino compiler).
extern "C" void regi2c_ctrl_write_reg_mask(uint8_t block, uint8_t host_id, uint8_t reg_add, uint8_t msb, uint8_t lsb, uint8_t data);
#define I2C_BOD            0x61
#define I2C_BOD_HOSTID     1
#define I2C_BOD_THRESHOLD  0x5


#if defined(CONFIG_IDF_TARGET_ESP32S2) | defined(CONFIG_IDF_TARGET_ESP32S3)  // ESP32-S2/S3 BOARDS(usb emulation)
#include "USB.h"
#include "USBMSC.h"
#include "exfathax.h"
#elif defined(CONFIG_IDF_TARGET_ESP32)  // ESP32 BOARDS
#define USBCONTROL false                // set to true if you are using usb control(wired up usb drive)
#define usbPin 4                        // set the pin you want to use for usb control
#else
#error "Selected board not supported"
#endif


                     // use PsFree [ true / false ]
#define PSFREE true  // use the newer psfree webkit exploit.
                     // this is fairly stable but may fail which will require you to try and load the payload again.
                     
                              // set the cpu frequency [ 80 / 160 / 240 ]
#define CPU_FREQ_DEFAULT 80   // lowers the cpu frequency to reduce heat and power draw.
                              // these values can be changed in the admin config page.

                                  // reduce wifi tx power [ true / false ]
#define LOW_TXPOWER_DEFAULT false // reduces the wifi tx power to 11dBm to lower heat.
                                  // the ps4 is right next to the dongle so high power is not needed.

                                                  // upstream NTP servers the ESP32 proxies the PS4's NTP
                                                  // queries to. On every PS4 request it queries all of them
                                                  // concurrently and returns the fastest valid reply (no local
                                                  // clock is cached). Defaults = fastest measured on the user's
                                                  // China network (tencent ~50ms, aliyun ~75ms).
#define NTP_SERVER1_DEFAULT "ntp.tencent.com"     // 1st, hostname or IP; override via config.ini NTP_SERVER1
#define NTP_SERVER2_DEFAULT "ntp2.tencent.com"    // 2nd; override via config.ini NTP_SERVER2
#define NTP_SERVER3_DEFAULT "ntp1.aliyun.com"     // 3rd; override via config.ini NTP_SERVER3
#define NTP_SERVER4_DEFAULT "time.windows.com"    // 4th, global anycast for provider diversity; override via config.ini NTP_SERVER4

                              // NTP time-sync forwarding feature [ true / false ]
#define USE_NTP_DEFAULT true  // enables sync + local NTP server + GoldHEN DNAT interception;
                              // override via config.ini USE_NTP

                              // diagnostic logger to /log.txt [ true / false ]
#define USE_LOG_DEFAULT true  // writes BOOT/DNS/NTP events; override via config.ini USE_LOG



//-------------------DEFAULT SETTINGS------------------//

                        // use config.ini [ true / false ]
#define USECONFIG true  // this will allow you to change these settings below via the admin webpage. 
                        // if you want to permanently use the values below then set this to false.

//create access point
boolean startAP = true;
String AP_SSID = "PS4";
String AP_PASS = "900cracker";
IPAddress Server_IP(10, 1, 1, 1);
IPAddress Subnet_Mask(255, 255, 255, 0);
// Upstream NTP servers the ESP32 relays the PS4's NTP queries to (up to 3,
// configurable via config.ini NTP_SERVER1 / NTP_SERVER2 / NTP_SERVER3 /
// NTP_SERVER4). No local clock is cached — each PS4 NTP request is answered
// directly from the fastest live upstream reply. The GoldHEN-side DNAT target
// (time1.google.com = 216.239.35.0) is fixed and NOT configurable.
String ntpServer1 = NTP_SERVER1_DEFAULT;
String ntpServer2 = NTP_SERVER2_DEFAULT;
String ntpServer3 = NTP_SERVER3_DEFAULT;
String ntpServer4 = NTP_SERVER4_DEFAULT;
boolean useNtp = USE_NTP_DEFAULT;
boolean useLog = USE_LOG_DEFAULT;

//connect to wifi
boolean connectWifi = true;
String WIFI_SSID = "WIFI_HOME";
String WIFI_PASS = "password123";
String WIFI_HOSTNAME = "ps4.local";

//server port
int WEB_PORT = 80;

//Auto Usb Wait(milliseconds)
int USB_WAIT = 10000;

// Displayed firmware version
String firmwareVer = "v1.0.0, 26/08/07 by DogEZ";

//ESP sleep after x minutes
boolean espSleep = false;
int TIME2SLEEP = 30;  // minutes

//Power save settings (applied on boot; override via config.ini)
int cpuFreq = CPU_FREQ_DEFAULT;
boolean lowTxPower = LOW_TXPOWER_DEFAULT;


//-----------------------------------------------------//


#include "Loader.h"
#include "Pages.h"
#include "jzip.h"

#include "SPIFFS.h"
#define FILESYS SPIFFS

DNSServer dnsServer;
WiFiUDP ntpServerUdp;
AsyncWebServer server(WEB_PORT);
WiFiUDP ntpProbeUdp;        // concurrent NTP probe (query all servers, use first reply)
IPAddress ntpProbeIps[4];   // resolved upstream NTP server addresses
int ntpProbeCount = 0;
uint32_t tSetup = 0;        // setup() start, for boot timing probes
boolean hasEnabled = false;
boolean isFormating = false;
long enTime = 0;
long bootTime = 0;
File upFile;
#if defined(CONFIG_IDF_TARGET_ESP32S2) | defined(CONFIG_IDF_TARGET_ESP32S3)
USBMSC dev;
#endif


/*
#if ARDUINO_USB_CDC_ON_BOOT
#define HWSerial Serial0
#define USBSerial Serial
#else
#define HWSerial Serial
#if defined(CONFIG_IDF_TARGET_ESP32S2) | defined(CONFIG_IDF_TARGET_ESP32S3)
USBCDC USBSerial;
#endif
#endif
*/


String split(String str, String from, String to) {
  String tmpstr = str;
  tmpstr.toLowerCase();
  from.toLowerCase();
  to.toLowerCase();
  int pos1 = tmpstr.indexOf(from);
  int pos2 = tmpstr.indexOf(to, pos1 + from.length());
  String retval = str.substring(pos1 + from.length(), pos2);
  return retval;
}


bool instr(String str, String search) {
  int result = str.indexOf(search);
  if (result == -1) {
    return false;
  }
  return true;
}


String formatBytes(size_t bytes) {
  if (bytes < 1024) {
    return String(bytes) + " B";
  } else if (bytes < (1024 * 1024)) {
    return String(bytes / 1024.0) + " KB";
  } else if (bytes < (1024 * 1024 * 1024)) {
    return String(bytes / 1024.0 / 1024.0) + " MB";
  } else {
    return String(bytes / 1024.0 / 1024.0 / 1024.0) + " GB";
  }
}


String urlencode(String str) {
  String encodedString = "";
  char c;
  char code0;
  char code1;
  char code2;
  for (int i = 0; i < str.length(); i++) {
    c = str.charAt(i);
    if (c == ' ') {
      encodedString += '+';
    } else if (isalnum(c)) {
      encodedString += c;
    } else {
      code1 = (c & 0xf) + '0';
      if ((c & 0xf) > 9) {
        code1 = (c & 0xf) - 10 + 'A';
      }
      c = (c >> 4) & 0xf;
      code0 = c + '0';
      if (c > 9) {
        code0 = c - 10 + 'A';
      }
      code2 = '\0';
      encodedString += '%';
      encodedString += code0;
      encodedString += code1;
    }
    yield();
  }
  encodedString.replace("%2E", ".");
  return encodedString;
}


void sendwebmsg(AsyncWebServerRequest *request, String htmMsg) {
  String tmphtm = "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"style.css\"></head><center><br><br><br><br><br><br>" + htmMsg + "</center></html>";
  request->send(200, "text/html", tmphtm);
}


