DdogezD/ps4-900u-host/ESP32_Server_900u_HTTP_SPIFFS/ESP32_Server_900u_HTTP_SPIFFS.ino
void handleInfo(AsyncWebServerRequest *request) {
  float flashFreq = (float)ESP.getFlashChipSpeed() / 1000.0 / 1000.0;
  FlashMode_t ideMode = ESP.getFlashChipMode();
  String mcuType = CONFIG_IDF_TARGET;
  mcuType.toUpperCase();
  String output = "<!DOCTYPE html><html><head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\"><title>System Information</title><link rel=\"stylesheet\" href=\"style.css\"></head>";
  output += "<hr>###### Software ######<br><br>";
  output += "Firmware version: " + firmwareVer + "<br>";
  output += "SDK version: " + String(ESP.getSdkVersion()) + "<br><hr>";
  output += "###### Board ######<br><br>";
  output += "MCU: " + mcuType + "<br>";
#if defined(USB_PRODUCT)
  output += "Board: " + String(USB_PRODUCT) + "<br>";
#endif
  output += "Chip Id: " + String(ESP.getChipModel()) + "<br>";
  output += "CPU frequency: " + String(ESP.getCpuFreqMHz()) + "MHz<br>";
  output += "Cores: " + String(ESP.getChipCores()) + "<br><hr>";
  output += "###### Flash chip information ######<br><br>";
  output += "Flash chip Id: " + String(ESP.getFlashChipMode()) + "<br>";
  output += "Estimated Flash size: " + formatBytes(ESP.getFlashChipSize()) + "<br>";
  output += "Flash frequency: " + String(flashFreq) + " MHz<br>";
  output += "Flash write mode: " + String((ideMode == FM_QIO ? "QIO" : ideMode == FM_QOUT ? "QOUT"
                                                                     : ideMode == FM_DIO  ? "DIO"
                                                                     : ideMode == FM_DOUT ? "DOUT"
                                                                                          : "UNKNOWN"))
            + "<br><hr>";
  output += "###### Storage information ######<br><br>";
  output += "Filesystem: SPIFFS<br>";
  output += "Total Size: " + formatBytes(FILESYS.totalBytes()) + "<br>";
  output += "Used Space: " + formatBytes(FILESYS.usedBytes()) + "<br>";
  output += "Free Space: " + formatBytes(FILESYS.totalBytes() - FILESYS.usedBytes()) + "<br><hr>";
#if defined(CONFIG_IDF_TARGET_ESP32S2) | defined(CONFIG_IDF_TARGET_ESP32S3)
  if (ESP.getPsramSize() > 0) {
    output += "###### PSRam information ######<br><br>";
    output += "Psram Size: " + formatBytes(ESP.getPsramSize()) + "<br>";
    output += "Free psram: " + formatBytes(ESP.getFreePsram()) + "<br>";
    output += "Max alloc psram: " + formatBytes(ESP.getMaxAllocPsram()) + "<br><hr>";
  }
#endif
  output += "###### Ram information ######<br><br>";
  output += "Ram size: " + formatBytes(ESP.getHeapSize()) + "<br>";
  output += "Free ram: " + formatBytes(ESP.getFreeHeap()) + "<br>";
  output += "Max alloc ram: " + formatBytes(ESP.getMaxAllocHeap()) + "<br><hr>";
  output += "###### Sketch information ######<br><br>";
  output += "Sketch hash: " + ESP.getSketchMD5() + "<br>";
  output += "Sketch size: " + formatBytes(ESP.getSketchSize()) + "<br>";
  output += "Free space available: " + formatBytes(ESP.getFreeSketchSpace() - ESP.getSketchSize()) + "<br><hr>";
  output += "</html>";
  request->send(200, "text/html", output);
}


#if USECONFIG
void writeConfig() {
  File iniFile = FILESYS.open("/config.ini", "w");
  if (iniFile) {
    String tmpua = "false";
    String tmpcw = "false";
    String tmpslp = "false";
    String tmpltx = "false";
    if (startAP) { tmpua = "true"; }
    if (connectWifi) { tmpcw = "true"; }
    if (espSleep) { tmpslp = "true"; }
    if (lowTxPower) { tmpltx = "true"; }
    iniFile.print("\r\nAP_SSID=" + AP_SSID + "\r\nAP_PASS=" + AP_PASS + "\r\nWEBSERVER_IP=" + Server_IP.toString() + "\r\nWEBSERVER_PORT=" + String(WEB_PORT) + "\r\nSUBNET_MASK=" + Subnet_Mask.toString() + "\r\nWIFI_SSID=" + WIFI_SSID + "\r\nWIFI_PASS=" + WIFI_PASS + "\r\nWIFI_HOST=" + WIFI_HOSTNAME + "\r\nUSEAP=" + tmpua + "\r\nCONWIFI=" + tmpcw + "\r\nUSBWAIT=" + USB_WAIT + "\r\nESPSLEEP=" + tmpslp + "\r\nSLEEPTIME=" + TIME2SLEEP + "\r\nCPU_FREQ=" + String(cpuFreq) + "\r\nLOW_TXPOWER=" + tmpltx + "\r\nNTP_SERVER1=" + ntpServer1 + "\r\nNTP_SERVER2=" + ntpServer2 + "\r\nNTP_SERVER3=" + ntpServer3 + "\r\nNTP_SERVER4=" + ntpServer4 + "\r\nUSE_NTP=" + String(useNtp ? "true" : "false") + "\r\nUSE_LOG=" + String(useLog ? "true" : "false") + "\r\n");
    iniFile.close();
  }
}
#endif






//Lower the power draw of the dongle: reduce CPU frequency (configurable via
//CPU_FREQ) and cut the WiFi TX power (the PS4 is right next to the dongle).
//Called after the WiFi stack has been started.
void applyPowerSettings() {
  // WiFi modem sleep / power save is ON by default and makes the softAP hang
  // when a client disconnects and reconnects. Always keep it disabled.
  WiFi.setSleep(false);
  if (cpuFreq == 80 || cpuFreq == 160 || cpuFreq == 240) {
    setCpuFrequencyMhz(cpuFreq);
  }
  if (lowTxPower) {
    WiFi.setTxPower(WIFI_POWER_11dBm);
  }
}


// Diagnostic logger: appends a timestamped line to /log.txt on the filesystem.
// Read it via http://ps4.local/log.txt (or the file manager). Disabled when
// USE_LOG / config.ini USE_LOG is false.
void appendLog(String line) {
  if (!useLog) { return; }
  // Cap the log so it can't fill the filesystem over many boots. Only BOOT and
  // NTP events are logged now (DNS per-query logging was removed because it
  // wrote the filesystem constantly and risked corruption on a power cut).
  if (FILESYS.exists("/log.txt")) {
    File chk = FILESYS.open("/log.txt", "r");
    if (chk) {
      if (chk.size() > 32768) { chk.close(); FILESYS.remove("/log.txt"); }
      else { chk.close(); }
    }
  }
  File f = FILESYS.open("/log.txt", "a");
  if (f) {
    f.print("[");
    f.print(millis());
    f.print("ms] ");
    f.println(line);
    f.close();
  }
}

// Human-readable ESP32 reset reason.
String resetReasonStr() {
  switch (esp_reset_reason()) {
    case ESP_RST_POWERON: return "POWERON";
    case ESP_RST_EXT: return "EXT";
    case ESP_RST_SW: return "SW";
    case ESP_RST_PANIC: return "PANIC";
    case ESP_RST_INT_WDT: return "INT_WDT";
    case ESP_RST_TASK_WDT: return "TASK_WDT";
    case ESP_RST_WDT: return "WDT";
    case ESP_RST_DEEPSLEEP: return "DEEPSLEEP";
    case ESP_RST_BROWNOUT: return "BROWNOUT";
    case ESP_RST_SDIO: return "SDIO";
    default: return String((int)esp_reset_reason());
  }
}

