DdogezD/ps4-900u-host/ESP32_Server_900u_HTTP_SPIFFS/ESP32_Server_900u_HTTP_SPIFFS.ino
// GoldHEN syncs its clock via NTP to a hardcoded server (time1.google.com =
// 216.239.35.0:123), bypassing DNS. The lwIP DNAT portmap in setup() rewrites
// those packets to this device's IP:123, so the PS4's UDP NTP requests arrive
// here. On each request we query the configured upstream NTP servers
// (NTP_SERVER1 / NTP_SERVER2 / NTP_SERVER3) CONCURRENTLY, take the fastest
// valid reply's time, and answer the PS4 with it directly — no local clock is
// cached (the ESP32-S2 has no external RTC crystal, so a cached time would
// drift). The reply source is rewritten back to the forwarded server's IP:123
// by the patched lwIP so the PS4 accepts it.
void handleNTPRequest() {
  int len = ntpServerUdp.parsePacket();
  if (len > 0) {
    appendLog("NTP from " + ntpServerUdp.remoteIP().toString() + " len=" + String(len));
  }
  if (len >= 48) {
    uint8_t buf[48];
    ntpServerUdp.read(buf, 48);
    // Query all upstream servers at once and use the first valid reply. Bounded
    // wait (~350ms) so the loop can't stall; with the fast China servers the
    // reply normally arrives in <100ms.
    uint32_t ntpSecs = ntpFastQuery(350);
    if (ntpSecs == 0) {
      // No valid upstream time (offline or all servers unreachable). Send NO
      // reply: the client retries. (A Kiss-of-Death with transmit=0 was tried
      // but the PS4's client mis-read it as the 2036 NTP wrap-around and set
      // the clock to 2036-02-07, so no reply is safer.)
      appendLog("NTP from " + ntpServerUdp.remoteIP().toString() + " SKIP-no-upstream");
      return;
    }
    appendLog("NTP from " + ntpServerUdp.remoteIP().toString() + " VN=" + String((buf[0] >> 3) & 7) + " answered");
    // Echo the client's transmit timestamp into the response's originate field.
    memcpy(buf + 24, buf + 40, 8);
    // LI=0, echo the client's NTP version, Mode=4 (server reply).
    buf[0] = (buf[0] & 0x38) | 0x04;
    buf[1] = 2;       // stratum 2 (secondary: we got time from upstream)
    buf[2] = 6;       // poll interval 2^6 = 64s
    buf[3] = 0xEC;    // precision 2^-20
    memset(buf + 4, 0, 8);  // root delay + root dispersion = 0
    // Reference ID = our AP IP (a valid IPv4 for a stratum-2 server).
    IPAddress ref = Server_IP;
    buf[12] = ref[0]; buf[13] = ref[1]; buf[14] = ref[2]; buf[15] = ref[3];
    // Write a 64-bit NTP timestamp (seconds + zero fraction) at the given offset.
    for (int off = 16; off <= 40; off += 8) {
      if (off == 24) { continue; }  // 24..31 is the originate field (echoed above)
      buf[off]     = (ntpSecs >> 24) & 0xFF;
      buf[off + 1] = (ntpSecs >> 16) & 0xFF;
      buf[off + 2] = (ntpSecs >> 8) & 0xFF;
      buf[off + 3] = ntpSecs & 0xFF;
      buf[off + 4] = buf[off + 5] = buf[off + 6] = buf[off + 7] = 0;
    }
    ntpServerUdp.beginPacket(ntpServerUdp.remoteIP(), ntpServerUdp.remotePort());
    ntpServerUdp.write(buf, 48);
    ntpServerUdp.endPacket();
  }
}

// Resolve the configured upstream NTP server hostnames once (blocking DNS).
void ntpProbeStart() {
  ntpProbeCount = 0;
  IPAddress ip;
  if (WiFi.hostByName(ntpServer1.c_str(), ip)) { ntpProbeIps[ntpProbeCount++] = ip; }
  if (WiFi.hostByName(ntpServer2.c_str(), ip)) { ntpProbeIps[ntpProbeCount++] = ip; }
  if (WiFi.hostByName(ntpServer3.c_str(), ip)) { ntpProbeIps[ntpProbeCount++] = ip; }
  if (WiFi.hostByName(ntpServer4.c_str(), ip)) { ntpProbeIps[ntpProbeCount++] = ip; }
}

// Send an NTP query to EVERY configured server concurrently, so whichever
// server is reachable first wins (vs. the sequential SNTP client which waits a
// full timeout per server).
void ntpProbeSend() {
  uint8_t q[48] = { 0 };
  q[0] = 0x1b;  // LI=0, VN=3, Mode=3 (client)
  for (int i = 0; i < ntpProbeCount; i++) {
    ntpProbeUdp.beginPacket(ntpProbeIps[i], 123);
    ntpProbeUdp.write(q, 48);
    ntpProbeUdp.endPacket();
  }
}

// Query every configured upstream NTP server concurrently and return the NTP
// epoch seconds (transmit timestamp) of the FIRST valid reply, or 0 if none
// arrives within timeoutMs. This is the direct, uncached path used to answer
// the PS4.
uint32_t ntpFastQuery(unsigned long timeoutMs) {
  if (ntpProbeCount == 0 || WiFi.status() != WL_CONNECTED) return 0;
  ntpProbeSend();
  unsigned long deadline = millis() + timeoutMs;
  while (millis() < deadline) {
    int len = ntpProbeUdp.parsePacket();
    if (len >= 48) {
      uint8_t buf[48];
      ntpProbeUdp.read(buf, 48);
      if ((buf[0] & 0x07) == 4) {  // Mode=4 (server reply)
        uint32_t secs = ((uint32_t)buf[40] << 24) | ((uint32_t)buf[41] << 16) | ((uint32_t)buf[42] << 8) | buf[43];
        if (secs > 2208988800UL) {
          appendLog("NTP upstream " + ntpProbeUdp.remoteIP().toString());
          return secs;  // NTP epoch seconds, used directly for the PS4 reply
        }
      }
    }
    delay(5);  // yield so lwIP processes inbound UDP
  }
  return 0;
}


void setup() {
  // Lower the ESP32-S2 brownout detector threshold from the core default
  // (level 7 ~2.9V = MOST sensitive) to level 4 (~2.7V), so marginal power
  // dips don't trigger a brownout reset that occasionally hangs on recovery.
  // Real low-voltage conditions still reset the chip.
  regi2c_ctrl_write_reg_mask(I2C_BOD, I2C_BOD_HOSTID, I2C_BOD_THRESHOLD, 2, 0, 4);  // level 4
  delay(50);  // let the power rail settle

  //HWSerial.begin(115200);
  //HWSerial.println("Version: " + firmwareVer);
  //USBSerial.begin();
  tSetup = millis();  // boot timing probe start

  // Run the whole boot at max CPU speed (240MHz) so the heavy early work
  // (filesystem mount, config parse, WiFi init) finishes ASAP; applyPowerSettings()
  // at the end of setup drops the clock back to the configured power-save
  // cpuFreq (80/160MHz).
  setCpuFrequencyMhz(240);

  pinMode(38, OUTPUT);
  digitalWrite(38, HIGH);

#if USBCONTROL && defined(CONFIG_IDF_TARGET_ESP32)
  pinMode(usbPin, OUTPUT);
  digitalWrite(usbPin, LOW);
#endif

  if (FILESYS.begin(true)) {
    appendLog("TIMING fs-mount ms=" + String(millis() - tSetup));

