DdogezD/ps4-900u-host/ESP32_Server_900u_HTTP_SPIFFS/ESP32_Server_900u_HTTP_SPIFFS.ino
#if USECONFIG
    if (FILESYS.exists("/config.ini")) {
      File iniFile = FILESYS.open("/config.ini", "r");
      if (iniFile) {
        String iniData;
        while (iniFile.available()) {
          char chnk = iniFile.read();
          iniData += chnk;
        }
        iniFile.close();

        if (instr(iniData, "AP_SSID=")) {
          AP_SSID = split(iniData, "AP_SSID=", "\r\n");
          AP_SSID.trim();
        }

        if (instr(iniData, "AP_PASS=")) {
          AP_PASS = split(iniData, "AP_PASS=", "\r\n");
          AP_PASS.trim();
        }

        if (instr(iniData, "WEBSERVER_IP=")) {
          String strwIp = split(iniData, "WEBSERVER_IP=", "\r\n");
          strwIp.trim();
          Server_IP.fromString(strwIp);
        }

        if (instr(iniData, "SUBNET_MASK=")) {
          String strsIp = split(iniData, "SUBNET_MASK=", "\r\n");
          strsIp.trim();
          Subnet_Mask.fromString(strsIp);
        }

        if (instr(iniData, "WIFI_SSID=")) {
          WIFI_SSID = split(iniData, "WIFI_SSID=", "\r\n");
          WIFI_SSID.trim();
        }

        if (instr(iniData, "WIFI_PASS=")) {
          WIFI_PASS = split(iniData, "WIFI_PASS=", "\r\n");
          WIFI_PASS.trim();
        }

        if (instr(iniData, "WIFI_HOST=")) {
          WIFI_HOSTNAME = split(iniData, "WIFI_HOST=", "\r\n");
          WIFI_HOSTNAME.trim();
        }

        if (instr(iniData, "USEAP=")) {
          String strua = split(iniData, "USEAP=", "\r\n");
          strua.trim();
          if (strua.equals("true")) {
            startAP = true;
          } else {
            startAP = false;
          }
        }

        if (instr(iniData, "CONWIFI=")) {
          String strcw = split(iniData, "CONWIFI=", "\r\n");
          strcw.trim();
          if (strcw.equals("true")) {
            connectWifi = true;
          } else {
            connectWifi = false;
          }
        }

        if (instr(iniData, "USBWAIT=")) {
          String strusw = split(iniData, "USBWAIT=", "\r\n");
          strusw.trim();
          USB_WAIT = strusw.toInt();
        }

        if (instr(iniData, "ESPSLEEP=")) {
          String strsl = split(iniData, "ESPSLEEP=", "\r\n");
          strsl.trim();
          if (strsl.equals("true")) {
            espSleep = true;
          } else {
            espSleep = false;
          }
        }

        if (instr(iniData, "SLEEPTIME=")) {
          String strslt = split(iniData, "SLEEPTIME=", "\r\n");
          strslt.trim();
          TIME2SLEEP = strslt.toInt();
        }

        if (instr(iniData, "CPU_FREQ=")) {
          String strcf = split(iniData, "CPU_FREQ=", "\r\n");
          strcf.trim();
          cpuFreq = strcf.toInt();
        }

        if (instr(iniData, "LOW_TXPOWER=")) {
          String strltx = split(iniData, "LOW_TXPOWER=", "\r\n");
          strltx.trim();
          if (strltx.equals("true")) { lowTxPower = true; } else { lowTxPower = false; }
        }

        if (instr(iniData, "NTP_SERVER1=")) {
          String strns1 = split(iniData, "NTP_SERVER1=", "\r\n");
          strns1.trim();
          if (strns1.length() > 0) { ntpServer1 = strns1; }
        }

        if (instr(iniData, "NTP_SERVER2=")) {
          String strns2 = split(iniData, "NTP_SERVER2=", "\r\n");
          strns2.trim();
          if (strns2.length() > 0) { ntpServer2 = strns2; }
        }

        if (instr(iniData, "NTP_SERVER3=")) {
          String strns3 = split(iniData, "NTP_SERVER3=", "\r\n");
          strns3.trim();
          if (strns3.length() > 0) { ntpServer3 = strns3; }
        }

        if (instr(iniData, "NTP_SERVER4=")) {
          String strns4 = split(iniData, "NTP_SERVER4=", "\r\n");
          strns4.trim();
          if (strns4.length() > 0) { ntpServer4 = strns4; }
        }

        if (instr(iniData, "USE_NTP=")) {
          String struntp = split(iniData, "USE_NTP=", "\r\n");
          struntp.trim();
          useNtp = struntp.equals("true");
        }

        if (instr(iniData, "USE_LOG=")) {
          String strulog = split(iniData, "USE_LOG=", "\r\n");
          strulog.trim();
          useLog = strulog.equals("true");
        }
      }
    } else {
      writeConfig();
    }
#endif

    // Boot/shutdown diagnostic marker (after config parse so USE_LOG applies).
    appendLog("BOOT reset=" + resetReasonStr() + " freeheap=" + String(ESP.getFreeHeap()) + " uptime_ms=" + String(millis()));

  } else {
    //HWSerial.println("Filesystem failed to mount");
  }

  if (startAP) {
    //HWSerial.println("SSID: " + AP_SSID);
    //HWSerial.println("Password: " + AP_PASS);
    //HWSerial.println("");
    //HWSerial.println("WEB Server IP: " + Server_IP.toString());
    //HWSerial.println("Subnet: " + Subnet_Mask.toString());
    //HWSerial.println("WEB Server Port: " + String(WEB_PORT));
    //HWSerial.println("");
    WiFi.softAPConfig(Server_IP, Server_IP, Subnet_Mask);
    WiFi.softAP(AP_SSID.c_str(), AP_PASS.c_str());
    //HWSerial.println("WIFI AP started");
    dnsServer.setTTL(30);
    dnsServer.setErrorReplyCode(DNSReplyCode::ServerFailure);
    dnsServer.start(53, "*", Server_IP);
    appendLog("TIMING ap-start ms=" + String(millis() - tSetup));
    //HWSerial.println("DNS server started");
    //HWSerial.println("DNS Server IP: " + Server_IP.toString());
  }

  if (connectWifi && WIFI_SSID.length() > 0 && WIFI_PASS.length() > 0) {
    WiFi.setAutoConnect(true);
    WiFi.setAutoReconnect(true);
    WiFi.hostname(WIFI_HOSTNAME);
    WiFi.begin(WIFI_SSID.c_str(), WIFI_PASS.c_str());
    appendLog("TIMING sta-begin ms=" + String(millis() - tSetup));
    // Async: do NOT block setup() waiting for the STA link. The AP+DNS server
    // above is already up (119ms), so the PS4 can be served immediately. The
    // STA-dependent init (mDNS, DNS-for-LAN when AP off, NTP probe resolution)
    // is done once in loop() once WiFi connects.
  }


  //Reduce power draw now that the WiFi stack is running
  applyPowerSettings();

  // Answer the PS4's NTP requests on UDP port 123 by querying the configured
  // upstream NTP servers (NTP_SERVER1/2/3) concurrently on every request. No
  // local clock is cached (the S2 has no external RTC crystal, so a cached time
  // would drift), so configTime is intentionally NOT used.
  if (useNtp) {
    ntpServerUdp.begin(123);
    // NTP probe hostname resolution is deferred to loop()'s STA-ready handler
    // (WiFi connects asynchronously; ntpProbeStart() needs a working link for
    // the blocking hostByName calls).
  }

  // GoldHEN syncs time via NTP to a hardcoded server (time1.google.com =
  // 216.239.35.0:123), bypassing DNS. Enable lwIP NAT on the AP and add a DNAT
  // portmap so those packets are redirected to the local NTP server. (Requires
  // the rebuilt core liblwip.a with CONFIG_LWIP_IPV4_NAPT; IP_FORWARD is off.)
#if IP_NAPT
  if (useNtp) {
    ip_napt_enable((u32_t)Server_IP, 1);
    ip_portmap_add(17, (u32_t)IPAddress(216, 239, 35, 0), 123, (u32_t)Server_IP, 123);  // 17 = IPPROTO_UDP
  }
#endif


  server.on("/connecttest.txt", HTTP_GET, [](AsyncWebServerRequest *request) {
    request->send(200, "text/plain", "Microsoft Connect Test");
  });
#if !USBCONTROL && defined(CONFIG_IDF_TARGET_ESP32)
  server.on("/cache.manifest", HTTP_GET, [](AsyncWebServerRequest *request) {
    handleCacheManifest(request);
  });
#endif

